ehughes/mcux-sdk/boards/boards/mcxn9xxbrk/trustzone_examples/hello_world/cm33_core0/hello_world_s/tzm_config.c
/*
 * Copyright 2022-2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: TEE v4.0
processor: MCXN947
package_id: MCXN947VDF
mcu_data: ksdk2_0
processor_version: 0.13.3
toolOptions:
  _output_type_: c_code
  _legacy_source_names_: 'yes'
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

/***********************************************************************************************************************
 * Included files
 **********************************************************************************************************************/
#include "fsl_common.h"
#include "tzm_config.h"

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/* SAU region boundaries */
#define SAU_REGION_0_BASE 0
#define SAU_REGION_0_END  0x0FFFFFFFU
#define SAU_REGION_1_BASE 0x20000000U
#define SAU_REGION_1_END  0xDFFFFFFFU
#define SAU_REGION_2_BASE 0x1001FE00U
#define SAU_REGION_2_END  0x1001FFFFU

/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
functional_group:
- called_from_default_init: 'true'
- id_prefix: ''
- prefix_user_defined: 'true'
- name: 'BOARD_InitTrustZone'
- description: ''
- ahb:
  - interrupts:
    - security: {Secure: {id: [ADC0_IRQn, ADC1_IRQn, BSP32_IRQn, CAN0_IRQn, CAN1_IRQn, CDOG0_IRQn, CDOG1_IRQn, CMC0_IRQn, CTI0_IRQn, CTIMER0_IRQn, CTIMER1_IRQn,
          CTIMER2_IRQn, CTIMER3_IRQn, CTIMER4_IRQn, DAC0_IRQn, DAC1_IRQn, DAC2_IRQn, EDMA_0_CH0_IRQn, EDMA_0_CH10_IRQn, EDMA_0_CH11_IRQn, EDMA_0_CH12_IRQn, EDMA_0_CH13_IRQn,
          EDMA_0_CH14_IRQn, EDMA_0_CH15_IRQn, EDMA_0_CH1_IRQn, EDMA_0_CH2_IRQn, EDMA_0_CH3_IRQn, EDMA_0_CH4_IRQn, EDMA_0_CH5_IRQn, EDMA_0_CH6_IRQn, EDMA_0_CH7_IRQn,
          EDMA_0_CH8_IRQn, EDMA_0_CH9_IRQn, EDMA_1_CH0_IRQn, EDMA_1_CH10_IRQn, EDMA_1_CH11_IRQn, EDMA_1_CH12_IRQn, EDMA_1_CH13_IRQn, EDMA_1_CH14_IRQn, EDMA_1_CH153_IRQn,
          EDMA_1_CH1_IRQn, EDMA_1_CH2_IRQn, EDMA_1_CH3_IRQn, EDMA_1_CH4_IRQn, EDMA_1_CH5_IRQn, EDMA_1_CH6_IRQn, EDMA_1_CH7_IRQn, EDMA_1_CH8_IRQn, EDMA_1_CH9_IRQn,
          ELS_ERR_IRQn, ELS_IRQn, EMVSIM0_IRQn, EMVSIM1_IRQn, ENC0_COMPARE_IRQn, ENC0_HOME_IRQn, ENC0_IDX_IRQn, ENC0_WDG_SAB_IRQn, ENC1_COMPARE_IRQn, ENC1_HOME_IRQn,
          ENC1_IDX_IRQn, ENC1_WDG_SAB_IRQn, ERM_MULTI_BIT_ERROR_IRQn, ERM_SINGLE_BIT_ERROR_IRQn, ETB0_IRQn, ETHERNET_IRQn, ETHERNET_MACLP_IRQn, ETHERNET_PMT_IRQn,
          EWM0_IRQn, FLEXIO_IRQn, FLEXPWM0_FAULT_IRQn, FLEXPWM0_RELOAD_ERROR_IRQn, FLEXPWM0_SUBMODULE0_IRQn, FLEXPWM0_SUBMODULE1_IRQn, FLEXPWM0_SUBMODULE2_IRQn, FLEXPWM0_SUBMODULE3_IRQn,
          FLEXPWM1_FAULT_IRQn, FLEXPWM1_RELOAD_ERROR_IRQn, FLEXPWM1_SUBMODULE!_IRQn, FLEXPWM1_SUBMODULE0_IRQn, FLEXPWM1_SUBMODULE2_IRQn, FLEXPWM1_SUBMODULE3_IRQn,
          FLEXSPI0_IRQn, FMU0_IRQn, Freqme_IRQn, GDET_IRQn, GPIO00_IRQn, GPIO01_IRQn, GPIO10_IRQn, GPIO11_IRQn, GPIO20_IRQn, GPIO21_IRQn, GPIO30_IRQn, GPIO31_IRQn,
          GPIO40_IRQn, GPIO41_IRQn, GPIO50_IRQn, GPIO51_IRQn, HSCMP0_IRQn, HSCMP1_IRQn, HSCMP2_IRQn, I3C0_IRQn, I3C1_IRQn, ITRC0_IRQn, LPTMR0_IRQn, LPTMR1_IRQn, LP_FLEXCOMM0_IRQn,
          LP_FLEXCOMM1_IRQn, LP_FLEXCOMM2_IRQn, LP_FLEXCOMM3_IRQn, LP_FLEXCOMM4_IRQn, LP_FLEXCOMM5_IRQn, LP_FLEXCOMM6_IRQn, LP_FLEXCOMM7_IRQn, LP_FLEXCOMM8_IRQn,
          LP_FLEXCOMM9_IRQn, MAILBOX_IRQn, MRT0_IRQn, NPU_IRQn, OR_IRQn, OS_EVENT_IRQn, PDM_EVENT_IRQn, PINT0_IRQn, PKC_ERR_IRQn, PKC_IRQn, PLU_IRQn, PORT_EFT_IRQn,
          PQ_IRQn, PUF_IRQn, RTC_IRQn, SAI0_IRQn, SAI1_IRQn, SCG_IRQn, SCT0_IRQn, SEC_HYPERVISOR_CALL_IRQn, SEC_VIO_IRQn, SINC_FILTER_IRQn, SM3_IRQn, SMARTDMA_IRQn,
          SPC_IRQn, TRNG0_IRQn, TSI_END_OF_SCAN_IRQn, TSI_OUT_OF_SCAN_IRQn, USB0_DCD_IRQn, USB0_FS_IRQn, USB1_HS_IRQn, USB1_HS_PHY_IRQn, USDHC0_IRQn, UTICK0_IRQn,
          VBAT0_IRQn, WUU_IRQn, WWDT0_IRQn, WWDT1_IRQn]}}
  - ports:
    - pio0: {Masked: {id: ['0', '1', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '2', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29',
          '3', '30', '31', '4', '5', '6', '7', '8', '9']}}
    - pio1: {Masked: {id: ['0', '1', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '2', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29',
          '3', '30', '31', '4', '5', '6', '7', '8', '9']}}
  - regions: [{memory: PROGRAM_FLASH0, security: s_priv, start: '0x00000000', size: '0x00020000'}, {memory: PROGRAM_FLASH0, security: ns_user, start: '0x00020000',
      size: '0x000E0000'}, {memory: PROGRAM_FLASH1, security: ns_user, start: '0x00000000', size: '0x00100000'}, {memory: FlashBank_IFR0, security: ns_user, start: '0x00000000',
      size: '0x00010000'}, {memory: FlashBank_IFR1, security: ns_user, start: '0x00000000', size: '0x00004000'}, {memory: BootROM, security: ns_user, start: '0x00000000',
      size: '0x00008000'}, {memory: BootROM, security: ns_user, start: '0x00018000', size: '0x00010000'}, {memory: BootROM, security: ns_user, start: '0x00038000',
      size: '0x00008000'}, {memory: SRAMX, security: ns_user, start: '0x00000000', size: '0x00018000'}, {memory: SRAMA, security: s_priv, start: '0x00000000', size: '0x00008000'},
    {memory: SRAMB, security: ns_user, start: '0x00000000', size: '0x00008000'}, {memory: SRAMC, security: ns_user, start: '0x00000000', size: '0x00010000'}, {memory: SRAMD,
      security: ns_user, start: '0x00000000', size: '0x00010000'}, {memory: SRAME, security: ns_user, start: '0x00000000', size: '0x00010000'}, {memory: SRAMF, security: ns_user,
      start: '0x00000000', size: '0x00010000'}, {memory: SRAMG, security: ns_user, start: '0x00000000', size: '0x00010000'}, {memory: SRAMH, security: ns_user, start: '0x00000000',
      size: '0x00008000'}, {memory: SPI_FILTER, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: OSTIMER0, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: TRO0, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_0_CH0, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_0_CH1, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_0_CH2, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_0_CH3, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_0_CH4, security: ns_priv, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_0_CH5, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_0_CH6, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_0_CH7, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_0_CH8, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_0_CH9, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_0_CH10, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_0_CH11, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_0_CH12, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_0_CH13, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_0_CH14, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_0_CH15, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_1_CH0, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_1_CH1, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_1_CH2, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_1_CH3, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_1_CH4, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_1_CH5, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_1_CH6, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_1_CH7, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_1_CH8, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_1_CH9, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_1_CH10, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_1_CH11, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_1_CH12, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_1_CH13, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: eDMA_1_CH14, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: eDMA_1_CH15, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: PKC_RAM, security: ns_user, start: '0x00000000',
      size: '0x00001000'}, {memory: USB_RAM, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: NPU, security: ns_user, start: '0x00000000', size: '0x00001000'},
    {memory: SFA, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: MBC, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: CAN0_RULE1,
      security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: CAN0_RULE2, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: CAN0_RULE3,
      security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: CAN1_RULE1, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: CAN1_RULE2,
      security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: CAN1_RULE3, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: MTR0,
      security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: ATX0, security: ns_user, start: '0x00000000', size: '0x00001000'}, {memory: FlexSPI0_0,
      security: ns_user, start: '0x00000000', size: '0x10000000'}, {memory: FlexSPI0_1, security: ns_user, start: '0x00000000', size: '0x10000000'}]
  - masters: {ns_user: {id: [COOLFLUXI, CPU1, DMA3_0, DMA3_1, ETHERNET, NPUO, PKC, PQ, SMARTDMA, USB_FS, USB_HS, USDHC]}}
  - peripherals: {ns_user: {id: [ADC0, ADC1, BSP32_0, CACHE64_POLSEL0, CAN0, CAN1, CDOG0, CDOG1, CMP0, CMP1, CMP2, CMX_PERFMON0, CMX_PERFMON1, CRC0, CTIMER0, CTIMER1,
        CTIMER2, CTIMER3, CTIMER4, DAC0, DAC1, DAC2, DM0, DMA0, DMA1, EIM0, ELS, ELS_ALIAS1, ELS_ALIAS2, ELS_ALIAS3, EMVSIM0, EMVSIM1, ENC0, ENC1, ENET0, ERM0, EVTG0,
        EWM0, FLEXIO0, FLEXSPI0, FMU0, FMU0TEST, FREQME0, GDET1, GPIO0, GPIO1, GPIO2, GPIO3, GPIO4, GPIO5, I3C0, I3C1, INPUTMUX0, INTM0, ITRC0, LPFLEXCOMM0, LPFLEXCOMM1,
        LPFLEXCOMM2, LPFLEXCOMM3, LPFLEXCOMM5, LPFLEXCOMM6, LPFLEXCOMM7, LPFLEXCOMM8, LPFLEXCOMM9, LPTMR0, LPTMR1, MAILBOX, MRT0, NPX0, OPAMP0, OPAMP1, OPAMP2, OTPC0,
        PDM, PINT0, PKC0, PLU0, PORT0, PORT1, PORT2, PORT3, PORT4, PORT5, POWERQUAD, RTC0, SAI0, SAI1, SCG0, SCT0, SEMA42_0, SINC0, SM3_0, SMARTDMA0, SPC0, TDET0,
        TSI0, USBDCD0, USBFS0, USBHS1__USBC, USBPHY, USDHC0, UTICK0, VBAT0, VREF0, WUU0, WWDT0, WWDT1]}, s_priv: {id: [AHBSC, AHBSC_ALIAS1, AHBSC_ALIAS2, AHBSC_ALIAS3,
        GPIO0_ALIAS1, GPIO1_ALIAS1, GPIO2_ALIAS1, GPIO3_ALIAS1, GPIO4_ALIAS1, GPIO5_ALIAS1, LPFLEXCOMM4, PUF, PUF_ALIAS1, PUF_ALIAS2, PUF_ALIAS3, PWM0, PWM1, SYSCON0,
        TRNG0]}}
- sau:
  - enabled: 'true'
  - all_non_secure: 'false'
  - generate_code_for_disabled_regions: 'false'
  - regions: [{index: '0', enabled: 'true', security: ns, start: '0x00000000', size: '0x10000000'}, {index: '1', enabled: 'true', security: ns, start: '0x20000000',
      size: '0xC0000000'}, {index: '2', enabled: 'true', security: nsc, start: '0x1001FE00', size: '0x00000200'}, {index: '3', enabled: 'false', security: ns, start: '0x00000000',
      size: '0x00000020'}, {index: '4', enabled: 'false', security: ns, start: '0x00000000', size: '0x00000020'}, {index: '5', enabled: 'false', security: ns, start: '0x00000000',
      size: '0x00000020'}, {index: '6', enabled: 'false', security: ns, start: '0x00000000', size: '0x00000020'}, {index: '7', enabled: 'false', security: ns, start: '0x00000000',
      size: '0x00000020'}]
- global_options:
  - no:
    - id: [AIRCR_PRIS, AIRCR_BFHFNMINS, AIRCR_SYSRESETREQS, SCR_SLEEPDEEPS, SHCSR_SECUREFAULTENA, NSACR_CP2, NSACR_CP3, NSACR_CP4, NSACR_CP5, NSACR_CP6, NSACR_CP7,
      CPPWR_SU0, CPPWR_SUS0, CPPWR_SU1, CPPWR_SUS1, CPPWR_SU2, CPPWR_SUS2, CPPWR_SU3, CPPWR_SUS3, CPPWR_SU4, CPPWR_SUS4, CPPWR_SU5, CPPWR_SUS5, CPPWR_SU6, CPPWR_SUS6,
      CPPWR_SU7, CPPWR_SUS7, CPPWR_SU10, CPPWR_SUS10, CPPWR_SU11, CPPWR_SUS11, SEC_GPIO_MASK0_LOCK, SEC_GPIO_MASK1_LOCK, SEC_CPU1_INT_MASK0_LOCK, SEC_CPU1_INT_MASK1_LOCK,
      SEC_CPU1_INT_MASK2_LOCK, SEC_CPU1_INT_MASK3_LOCK, SEC_CPU1_INT_MASK4_LOCK, MASTER_SEC_LEVEL_LOCK, CPU0_LOCK_NS_VTOR, CPU0_LOCK_NS_MPU, CPU0_LOCK_S_VTAIRCR,
      CPU0_LOCK_S_MPU, CPU0_LOCK_SAU, CM33_LOCK_REG_LOCK, CPU1_LOCK_NS_VTOR, CPU1_LOCK_NS_MPU, AHB_MISC_CTRL_REG_IDAU_ALL_NS, AHB_MISC_CTRL_REG_DISABLE_VIOLATION_ABORT,
      AHB_MISC_CTRL_REG_ENABLE_NS_PRIV_CHECK, AHB_MISC_CTRL_REG_ENABLE_S_PRIV_CHECK, AHB_MISC_CTRL_REG_WRITE_LOCK]
  - yes:
    - id: [NSACR_CP0, NSACR_CP1, NSACR_CP10, NSACR_CP11, AHB_MISC_CTRL_REG_DISABLE_STRICT_MODE, AHB_MISC_CTRL_REG_ENABLE_SECURE_CHECKING]
- user_memory_regions: [{id: Region_1, security: s_priv, name: Secure Code, start: '0x10000000', size: '0x0001FE00'}, {id: Region_2, security: nsc_priv, name: Veneer
      Table, start: '0x1001FE00', size: '0x00000200'}, {id: Region_3, security: s_priv, name: Secure Stack and Data, start: '0x30000000', size: '0x00008000'}, {id: Region_4,
    security: ns_user, name: Non-secure Code, description: Privilege check is disabled so reset value (NS-User) can be used, start: '0x00020000', size: '0x000A0000'},
  {id: Region_5, security: ns_user, name: Non-secure Stack and Data, start: '0x20008000', size: '0x00046000'}]
- mpus:
  - mpu:
    - enabled: 'false'
    - id: 's'
    - priv_default_map: 'false'
    - handler_enabled: 'false'
    - generate_code_for_disabled_regions: 'false'
    - attributes: [{index: '0', id: '0', memory_type: device, device: nGnRE}, {index: '1', id: '1', memory_type: device, device: nGnRE}, {index: '2', id: '2', memory_type: device,
        device: nGnRE}, {index: '3', id: '3', memory_type: device, device: nGnRE}, {index: '4', id: '4', memory_type: device, device: nGnRE}, {index: '5', id: '5',
        memory_type: device, device: nGnRE}, {index: '6', id: '6', memory_type: device, device: nGnRE}, {index: '7', id: '7', memory_type: device, device: nGnRE}]
    - regions: [{executable: 'false', read_only: 'false', attributes_index: '0', index: '0', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'},
      {executable: 'false', read_only: 'false', attributes_index: '0', index: '1', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false',
        read_only: 'false', attributes_index: '0', index: '2', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false',
        attributes_index: '0', index: '3', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0',
        index: '4', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0', index: '5',
        enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0', index: '6', enabled: 'false',
        security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0', index: '7', enabled: 'false', security: priv,
        start: '0x00000000', size: '0x00000020'}]
  - mpu:
    - enabled: 'false'
    - id: 'ns'
    - priv_default_map: 'false'
    - handler_enabled: 'false'
    - generate_code_for_disabled_regions: 'false'
    - attributes: [{index: '0', id: '0', memory_type: device, device: nGnRE}, {index: '1', id: '1', memory_type: device, device: nGnRE}, {index: '2', id: '2', memory_type: device,
        device: nGnRE}, {index: '3', id: '3', memory_type: device, device: nGnRE}, {index: '4', id: '4', memory_type: device, device: nGnRE}, {index: '5', id: '5',
        memory_type: device, device: nGnRE}, {index: '6', id: '6', memory_type: device, device: nGnRE}, {index: '7', id: '7', memory_type: device, device: nGnRE}]
    - regions: [{executable: 'false', read_only: 'false', attributes_index: '0', index: '0', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'},
      {executable: 'false', read_only: 'false', attributes_index: '0', index: '1', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false',
        read_only: 'false', attributes_index: '0', index: '2', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false',
        attributes_index: '0', index: '3', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0',
        index: '4', enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0', index: '5',
        enabled: 'false', security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0', index: '6', enabled: 'false',
        security: priv, start: '0x00000000', size: '0x00000020'}, {executable: 'false', read_only: 'false', attributes_index: '0', index: '7', enabled: 'false', security: priv,
        start: '0x00000000', size: '0x00000020'}]
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

