ehughes/mcux-sdk/boards/boards/mcxn9xxbrk/trustzone_examples/hello_world/cm33_core0/hello_world_s/tzm_config.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTrustZone
 * Description   :
 *
 * END ****************************************************************************************************************/

/***********************************************************************************************************************
 * BOARD_InitTrustZone function
 **********************************************************************************************************************/
void BOARD_InitTrustZone()
{
    /* SAU configuration */

    /* Set SAU Control register: Disable SAU and All Secure */
    SAU->CTRL = 0;

    /* Set SAU region number */
    SAU->RNR = 0;
    /* Region base address */
    SAU->RBAR = SAU_REGION_0_BASE & SAU_RBAR_BADDR_Msk;
    /* Region end address */
    SAU->RLAR = (SAU_REGION_0_END & SAU_RLAR_LADDR_Msk) | ((0U << SAU_RLAR_NSC_Pos) & SAU_RLAR_NSC_Msk) |
                ((1U << SAU_RLAR_ENABLE_Pos) & SAU_RLAR_ENABLE_Msk);

    /* Set SAU region number */
    SAU->RNR = 1;
    /* Region base address */
    SAU->RBAR = SAU_REGION_1_BASE & SAU_RBAR_BADDR_Msk;
    /* Region end address */
    SAU->RLAR = (SAU_REGION_1_END & SAU_RLAR_LADDR_Msk) | ((0U << SAU_RLAR_NSC_Pos) & SAU_RLAR_NSC_Msk) |
                ((1U << SAU_RLAR_ENABLE_Pos) & SAU_RLAR_ENABLE_Msk);

    /* Set SAU region number */
    SAU->RNR = 2;
    /* Region base address */
    SAU->RBAR = SAU_REGION_2_BASE & SAU_RBAR_BADDR_Msk;
    /* Region end address */
    SAU->RLAR = (SAU_REGION_2_END & SAU_RLAR_LADDR_Msk) | ((1U << SAU_RLAR_NSC_Pos) & SAU_RLAR_NSC_Msk) |
                ((1U << SAU_RLAR_ENABLE_Pos) & SAU_RLAR_ENABLE_Msk);

    /* Force memory writes before continuing */
    __DSB();
    /* Flush and refill pipeline with updated permissions */
    __ISB();

    /* Set SAU Control register: Enable SAU and All Secure (applied only if disabled) */
    SAU->CTRL = ((0U << SAU_CTRL_ALLNS_Pos) & SAU_CTRL_ALLNS_Msk) | ((1U << SAU_CTRL_ENABLE_Pos) & SAU_CTRL_ENABLE_Msk);

    /* AHB configuration */

    /*--------------------------------------------------------------------
     - AHB Security Level Configurations
     -------------------------------------------------------------------*/
    /* Configuration of AHB Secure Controller
       Possible values for every memory sector or peripheral rule:
        0    Non-secure, User access allowed.
        1    Non-secure, Privileged access allowed.
        2    Secure, User access allowed.
        3    Secure, Privileged access allowed.
    */

    /* Security level configuration of MPC checker */
    AHBSC->FLASH00_MEM_RULE[0]                                       = 0x00003333U;
    AHBSC->FLASH00_MEM_RULE[1]                                       = 0;
    AHBSC->FLASH00_MEM_RULE[2]                                       = 0;
    AHBSC->FLASH00_MEM_RULE[3]                                       = 0;
    AHBSC->FLASH01_MEM_RULE[0]                                       = 0;
    AHBSC->FLASH01_MEM_RULE[1]                                       = 0;
    AHBSC->FLASH01_MEM_RULE[2]                                       = 0;
    AHBSC->FLASH01_MEM_RULE[3]                                       = 0;
    AHBSC->FLASH02_MEM_RULE                                          = 0;
    AHBSC->FLASH03_MEM_RULE                                          = 0;
    AHBSC->ROM_MEM_RULE[0]                                           = 0;
    AHBSC->ROM_MEM_RULE[1]                                           = 0;
    AHBSC->ROM_MEM_RULE[2]                                           = 0;
    AHBSC->ROM_MEM_RULE[3]                                           = 0;
    AHBSC->RAMX_MEM_RULE[0]                                          = 0;
    AHBSC->RAMX_MEM_RULE[1]                                          = 0;
    AHBSC->RAMX_MEM_RULE[2]                                          = 0;
    AHBSC->RAMA_MEM_RULE                                             = 0x33333333U;
    AHBSC->RAMB_MEM_RULE                                             = 0;
    AHBSC->RAMC_MEM_RULE[0]                                          = 0;
    AHBSC->RAMC_MEM_RULE[1]                                          = 0;
    AHBSC->RAMD_MEM_RULE[0]                                          = 0;
    AHBSC->RAMD_MEM_RULE[1]                                          = 0;
    AHBSC->RAME_MEM_RULE[0]                                          = 0;
    AHBSC->RAME_MEM_RULE[1]                                          = 0;
    AHBSC->RAMF_MEM_RULE[0]                                          = 0;
    AHBSC->RAMF_MEM_RULE[1]                                          = 0;
    AHBSC->RAMG_MEM_RULE[0]                                          = 0;
    AHBSC->RAMG_MEM_RULE[1]                                          = 0;
    AHBSC->RAMH_MEM_RULE                                             = 0;
    AHBSC->FLEXSPI0_REGION0_MEM_RULE[0]                              = 0;
    AHBSC->FLEXSPI0_REGION0_MEM_RULE[1]                              = 0;
    AHBSC->FLEXSPI0_REGION0_MEM_RULE[2]                              = 0;
    AHBSC->FLEXSPI0_REGION0_MEM_RULE[3]                              = 0;
    AHBSC->FLEXSPI0_REGION1_6_MEM_RULE[0].FLEXSPI0_REGION_MEM_RULE0  = 0;
    AHBSC->FLEXSPI0_REGION1_6_MEM_RULE[1].FLEXSPI0_REGION_MEM_RULE0  = 0;
    AHBSC->FLEXSPI0_REGION1_6_MEM_RULE[2].FLEXSPI0_REGION_MEM_RULE0  = 0;
    AHBSC->FLEXSPI0_REGION1_6_MEM_RULE[3].FLEXSPI0_REGION_MEM_RULE0  = 0;
    AHBSC->FLEXSPI0_REGION1_6_MEM_RULE[4].FLEXSPI0_REGION_MEM_RULE0  = 0;
    AHBSC->FLEXSPI0_REGION1_6_MEM_RULE[5].FLEXSPI0_REGION_MEM_RULE0  = 0;
    AHBSC->FLEXSPI0_REGION7_MEM_RULE[0]                              = 0;
    AHBSC->FLEXSPI0_REGION7_MEM_RULE[1]                              = 0;
    AHBSC->FLEXSPI0_REGION7_MEM_RULE[2]                              = 0;
    AHBSC->FLEXSPI0_REGION7_MEM_RULE[3]                              = 0;
    AHBSC->FLEXSPI0_REGION8_13_MEM_RULE[0].FLEXSPI0_REGION_MEM_RULE0 = 0;
    AHBSC->FLEXSPI0_REGION8_13_MEM_RULE[1].FLEXSPI0_REGION_MEM_RULE0 = 0;
    AHBSC->FLEXSPI0_REGION8_13_MEM_RULE[2].FLEXSPI0_REGION_MEM_RULE0 = 0;
    AHBSC->FLEXSPI0_REGION8_13_MEM_RULE[3].FLEXSPI0_REGION_MEM_RULE0 = 0;
    AHBSC->FLEXSPI0_REGION8_13_MEM_RULE[4].FLEXSPI0_REGION_MEM_RULE0 = 0;
    AHBSC->FLEXSPI0_REGION8_13_MEM_RULE[5].FLEXSPI0_REGION_MEM_RULE0 = 0;
    AHBSC->APB_PERIPHERAL_GROUP0_MEM_RULE0                           = 0x33330333U;
    AHBSC->APB_PERIPHERAL_GROUP0_MEM_RULE2                           = 0x33303333U;
    AHBSC->AHB_PERIPHERAL1_SLAVE_PORT_P13_SLAVE_RULE0                = 0x33303303U;
    AHBSC->AIPS_BRIDGE_GROUP0_MEM_RULE0                              = 0x03333333U;
    AHBSC->AHB_PERIPHERAL1_SLAVE_PORT_P13_SLAVE_RULE1                = 0x03330333U;
    AHBSC->AIPS_BRIDGE_GROUP3_MEM_RULE0                              = 0x03033333U;
    AHBSC->AIPS_BRIDGE_GROUP3_MEM_RULE2                              = 0x00033333U;
    AHBSC->AIPS_BRIDGE_GROUP3_MEM_RULE3                              = 0x33330003U;
    AHBSC->AIPS_BRIDGE_GROUP4_MEM_RULE3                              = 0x00333333U;
    AHBSC->AIPS_BRIDGE_GROUP1_MEM_RULE0                              = 0x00100003U;
    AHBSC->AIPS_BRIDGE_GROUP1_MEM_RULE1                              = 0;
    AHBSC->AHB_PERIPHERAL0_SLAVE_PORT_P12_SLAVE_RULE0                = 0x33333303U;
    AHBSC->AIPS_BRIDGE_GROUP2_MEM_RULE0                              = 0x00000003U;
    AHBSC->AIPS_BRIDGE_GROUP2_MEM_RULE1                              = 0;

    /* Security level configuration of PPC checker */
    AHBSC->APB_PERIPHERAL_GROUP0_MEM_RULE0            = 0xFCFCFFFFU;
    AHBSC->APB_PERIPHERAL_GROUP0_MEM_RULE1            = 0xCCCCFFFFU;
    AHBSC->APB_PERIPHERAL_GROUP0_MEM_RULE2            = 0xCCFFCCCCU;
    AHBSC->APB_PERIPHERAL_GROUP0_MEM_RULE3            = 0xFFFFCFFFU;
    AHBSC->APB_PERIPHERAL_GROUP1_MEM_RULE0            = 0xFCCFFCCFU;
    AHBSC->APB_PERIPHERAL_GROUP1_MEM_RULE1            = 0xFFFFCFFFU;
    AHBSC->APB_PERIPHERAL_GROUP1_MEM_RULE2            = 0xFFFCCCCFU;
    AHBSC->AIPS_BRIDGE_GROUP0_MEM_RULE0               = 0xFCCCCCFCU;
    AHBSC->AIPS_BRIDGE_GROUP0_MEM_RULE1               = 0xFCFCCCFFU;
    AHBSC->AIPS_BRIDGE_GROUP0_MEM_RULE2               = 0xCCCCCCCCU;
    AHBSC->AIPS_BRIDGE_GROUP0_MEM_RULE3               = 0xFFCCCFCCU;
    AHBSC->AIPS_BRIDGE_GROUP1_MEM_RULE0               = 0xFFFFFFFCU;
    AHBSC->AHB_PERIPHERAL0_SLAVE_PORT_P12_SLAVE_RULE0 = 0xCCCCCCFFU;
    AHBSC->AHB_PERIPHERAL0_SLAVE_PORT_P12_SLAVE_RULE1 = 0xCFCFCFCFU;
    AHBSC->AHB_PERIPHERAL0_SLAVE_PORT_P12_SLAVE_RULE2 = 0xFFFFFFFFU;
    AHBSC->AHB_PERIPHERAL1_SLAVE_PORT_P13_SLAVE_RULE0 = 0xCCFFCCFFU;
    AHBSC->AHB_PERIPHERAL1_SLAVE_PORT_P13_SLAVE_RULE1 = 0xFCCCFCCCU;
    AHBSC->AHB_PERIPHERAL1_SLAVE_PORT_P13_SLAVE_RULE2 = 0xFFFFFFFCU;
    AHBSC->AIPS_BRIDGE_GROUP3_MEM_RULE0               = 0xFFFFFCCCU;
    AHBSC->AIPS_BRIDGE_GROUP3_MEM_RULE1               = 0xCFFCCFCCU;
    AHBSC->AIPS_BRIDGE_GROUP3_MEM_RULE2               = 0xFFFCFCCFU;
    AHBSC->AIPS_BRIDGE_GROUP3_MEM_RULE3               = 0xFFCCFFFCU;
    AHBSC->AIPS_BRIDGE_GROUP4_MEM_RULE0               = 0xCCCCCFF0U;
    AHBSC->AIPS_BRIDGE_GROUP4_MEM_RULE1               = 0xCCCCCCCCU;
    AHBSC->AIPS_BRIDGE_GROUP4_MEM_RULE2               = 0xCCCCCCCCU;
    AHBSC->AIPS_BRIDGE_GROUP4_MEM_RULE3               = 0xFFFFFCCCU;
    AHBSC->AHB_SECURE_CTRL_PERIPHERAL_RULE0           = 0xFFFFFFFFU;

