ehughes/mcux-sdk/boards/boards/mcxn9xxbrk/trustzone_examples/hello_world/cm33_core0/hello_world_s/tzm_config.c
    /* Security level configuration of masters */
    AHBSC->MASTER_SEC_LEVEL        = 0x80000000U;
    AHBSC->MASTER_SEC_ANTI_POL_REG = 0xBFFFFFFFU;

    /*--------------------------------------------------------------------
     - Pins: Reading GPIO state
     -------------------------------------------------------------------*/
    /* Possible values for every pin:
     *  0b0    Deny
     *  0b1    Allow */
    AHBSC->SEC_GPIO_MASK[0] = 0;
    AHBSC->SEC_GPIO_MASK[1] = 0;

    /*--------------------------------------------------------------------
     - Interrupts: Interrupt security configuration
     -------------------------------------------------------------------*/
    /* Possible values for every interrupt:
     *  0b0    Secure
     *  0b1    Non-secure */
    NVIC->ITNS[0] = 0;
    NVIC->ITNS[1] = 0;
    NVIC->ITNS[2] = 0;
    NVIC->ITNS[3] = 0;
    NVIC->ITNS[4] = 0;

    /* Global Options */
    SCB->AIRCR = (SCB->AIRCR & 0x00009FF7U) | 0x05FA0000U;
    SCB->SCR &= 0xFFFFFFF7U;
    SCB->SHCSR &= 0xFFF7FFFFU;
    SCB->NSACR                     = 0x00000C03U;
    SCnSCB->CPPWR                  = 0;
    AHBSC->SEC_GP_REG_LOCK         = 0xAAAAAAAAU;
    AHBSC->MASTER_SEC_LEVEL        = (AHBSC->MASTER_SEC_LEVEL & 0x3FFFFFFFU) | 0x80000000U;
    AHBSC->MASTER_SEC_ANTI_POL_REG = (AHBSC->MASTER_SEC_ANTI_POL_REG & 0x3FFFFFFFU) | 0x80000000U;
    AHBSC->CPU0_LOCK_REG           = 0x800002AAU;
    AHBSC->CPU1_LOCK_REG           = 0x0000000AU;
    AHBSC->MISC_CTRL_REG           = 0x000086A6U;
    AHBSC->MISC_CTRL_DP_REG        = 0x000086A6U;
}

/***********************************************************************************************************************
 * BOARD_InitBootTEE function
 **********************************************************************************************************************/
void BOARD_InitBootTEE()
{
    BOARD_InitTrustZone();
}
